# BuiltInFailures.AnalyticalAutomationFailures Class

---
Failures about Analytical Automation.
SystemObject Autodesk.Revit.DBBuiltInFailuresAnalyticalAutomationFailures
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public static class AnalyticalAutomationFailures

    Public NotInheritable Class AnalyticalAutomationFailures

    public ref class AnalyticalAutomationFailures abstract sealed

    [<AbstractClassAttribute>]
    [<SealedAttribute>]
    type AnalyticalAutomationFailures = class end
The BuiltInFailuresAnalyticalAutomationFailures type exposes the following members.
| Name| Description
---|---|---
| EmptySelection|  There are no selected elements.
Top
#### Reference
Autodesk.Revit.DB Namespace